---
kind: method
id: M:Autodesk.Revit.DB.BasePoint.GetProjectBasePoint(Autodesk.Revit.DB.Document)
source: html/fa70b69b-0339-15d9-7549-fafdb442f756.htm
---
# Autodesk.Revit.DB.BasePoint.GetProjectBasePoint Method

Gets the project base point for the document.

## Syntax (C#)
```csharp
public static BasePoint GetProjectBasePoint(
	Document cda
)
```

## Parameters
- **cda** (`Autodesk.Revit.DB.Document`) - The document from which to get the project base point.

## Returns
The project base point of the document.

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - A non-optional argument was null